xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/01.controller_unit.old/system/libs/fwlib/py32l090_hal_flash.h
/** @defgroup FLASH_OB_USER_Type FLASH User Option Type
  * @{
  */
#define OB_USER_NRST_STDBY      FLASH_OPTR_NRST_STDBY
#define OB_USER_NRST_STOP       FLASH_OPTR_NRST_STOP
#define OB_USER_IWDG_STDBY      FLASH_OPTR_IWDG_STDBY
#define OB_USER_IWDG_STOP       FLASH_OPTR_IWDG_STOP
#define OB_USER_IWDG_SW         FLASH_OPTR_IWDG_SW
#define OB_USER_WWDG_SW         FLASH_OPTR_WWDG_SW
#define OB_USER_NRST_MODE       FLASH_OPTR_NRST_MODE 
#define OB_USER_NBOOT1          FLASH_OPTR_NBOOT1  
#define OB_USER_BOR_EN          FLASH_OPTR_BOR_EN  
#define OB_USER_BOR_LEV         FLASH_OPTR_BOR_LEV 
#define OB_USER_SRAM_PE         FLASH_OPTR_SRAM_PE
#define OB_USER_SWD_MODE        FLASH_OPTR_SWD_MODE
#define OB_USER_BFB             FLASH_OPTR_BFB
#define OB_USER_BOOT_LOCK       FLASH_OPTR_BOOT_LOCK
#define OB_USER_ECC_EN          FLASH_OPTR_ECC_EN

/*#define OB_USER_OPTR_MSK        (OB_USER_NRST_STDBY | OB_USER_NRST_STOP | OB_USER_IWDG_STDBY | OB_USER_IWDG_STOP \
                               | OB_USER_IWDG_SW | OB_USER_WWDG_SW | OB_USER_NRST_MODE | OB_USER_NBOOT1  \
                               | OB_USER_SRAM_PE | OB_USER_SWD_MODE | OB_USER_BFB | OB_USER_BOOT_LOCK | OB_USER_ECC_EN)
*/

#define OB_USER_OPTR_MSK   (OB_USER_NRST_STDBY | OB_USER_NRST_STOP | OB_USER_IWDG_STDBY | OB_USER_IWDG_STOP \
                               | OB_USER_IWDG_SW | OB_USER_WWDG_SW | OB_USER_NRST_MODE | OB_USER_NBOOT1 | OB_USER_BOR_EN \
                               | OB_USER_BOR_LEV | OB_USER_SRAM_PE | OB_USER_SWD_MODE | OB_USER_BFB | OB_USER_BOOT_LOCK | OB_USER_ECC_EN)


 
/**
  * @}
  */

/** @defgroup FLASH_Option_Bytes_Write_Protection FLASH Option Bytes Write Protection
  * @{
  */
#define FLASH_WRPR_WRP_0                0x00000001U  /* Write protection of Bank0 Sector0 */
#define FLASH_WRPR_WRP_1                0x00000002U  /* Write protection of Bank0 Sector1 */
#define FLASH_WRPR_WRP_2                0x00000004U  /* Write protection of Bank0 Sector2 */
#define FLASH_WRPR_WRP_3                0x00000008U  /* Write protection of Bank0 Sector3 */
#define FLASH_WRPR_WRP_4                0x00000010U  /* Write protection of Bank0 Sector4 */
#define FLASH_WRPR_WRP_5                0x00000020U  /* Write protection of Bank0 Sector5 */
#define FLASH_WRPR_WRP_6                0x00000040U  /* Write protection of Bank0 Sector6 */
#define FLASH_WRPR_WRP_7                0x00000080U  /* Write protection of Bank0 Sector7 */
#define FLASH_WRPR_WRP_8                0x00000100U  /* Write protection of Bank0 Sector8 */
#define FLASH_WRPR_WRP_9                0x00000200U  /* Write protection of Bank0 Sector9 */
#define FLASH_WRPR_WRP_10               0x00000400U  /* Write protection of Bank0 Sector10 */
#define FLASH_WRPR_WRP_11               0x00000800U  /* Write protection of Bank0 Sector11 */
#define FLASH_WRPR_WRP_12               0x00001000U  /* Write protection of Bank0 Sector12 */
#define FLASH_WRPR_WRP_13               0x00002000U  /* Write protection of Bank0 Sector13 */
#define FLASH_WRPR_WRP_14               0x00004000U  /* Write protection of Bank0 Sector14 */
#define FLASH_WRPR_WRP_15               0x00008000U  /* Write protection of Bank0 Sector15 */
#define FLASH_WRPR_WRP_16               0x00010000U  /* Write protection of Bank1 Sector0 */
#define FLASH_WRPR_WRP_17               0x00020000U  /* Write protection of Bank1 Sector1 */
#define FLASH_WRPR_WRP_18               0x00040000U  /* Write protection of Bank1 Sector2 */
#define FLASH_WRPR_WRP_19               0x00080000U  /* Write protection of Bank1 Sector3 */
#define FLASH_WRPR_WRP_20               0x00100000U  /* Write protection of Bank1 Sector4 */
#define FLASH_WRPR_WRP_21               0x00200000U  /* Write protection of Bank1 Sector5 */
#define FLASH_WRPR_WRP_22               0x00400000U  /* Write protection of Bank1 Sector6 */
#define FLASH_WRPR_WRP_23               0x00800000U  /* Write protection of Bank1 Sector7 */
#define FLASH_WRPR_WRP_24               0x01000000U  /* Write protection of Bank1 Sector8 */
#define FLASH_WRPR_WRP_25               0x02000000U  /* Write protection of Bank1 Sector9 */
#define FLASH_WRPR_WRP_26               0x04000000U  /* Write protection of Bank1 Sector10 */
#define FLASH_WRPR_WRP_27               0x08000000U  /* Write protection of Bank1 Sector11 */
#define FLASH_WRPR_WRP_28               0x10000000U  /* Write protection of Bank1 Sector12 */
#define FLASH_WRPR_WRP_29               0x20000000U  /* Write protection of Bank1 Sector13 */
#define FLASH_WRPR_WRP_30               0x40000000U  /* Write protection of Bank1 Sector14 */
#define FLASH_WRPR_WRP_31               0x80000000U  /* Write protection of Bank1 Sector15 */
#define FLASH_WRPR_WRP                  0xFFFFFFFFU  /* Write protection of ALL */

#define OB_WRP_BANK0_SECTOR_0                  FLASH_WRPR_WRP_0   /* Write protection of Bank0 Sector0 */
#define OB_WRP_BANK0_SECTOR_1                  FLASH_WRPR_WRP_1   /* Write protection of Bank0 Sector1 */
#define OB_WRP_BANK0_SECTOR_2                  FLASH_WRPR_WRP_2   /* Write protection of Bank0 Sector2 */
#define OB_WRP_BANK0_SECTOR_3                  FLASH_WRPR_WRP_3   /* Write protection of Bank0 Sector3 */
#define OB_WRP_BANK0_SECTOR_4                  FLASH_WRPR_WRP_4   /* Write protection of Bank0 Sector4 */
#define OB_WRP_BANK0_SECTOR_5                  FLASH_WRPR_WRP_5   /* Write protection of Bank0 Sector5 */
#define OB_WRP_BANK0_SECTOR_6                  FLASH_WRPR_WRP_6   /* Write protection of Bank0 Sector6 */
#define OB_WRP_BANK0_SECTOR_7                  FLASH_WRPR_WRP_7   /* Write protection of Bank0 Sector7 */
#define OB_WRP_BANK0_SECTOR_8                  FLASH_WRPR_WRP_8   /* Write protection of Bank0 Sector8 */
#define OB_WRP_BANK0_SECTOR_9                  FLASH_WRPR_WRP_9   /* Write protection of Bank0 Sector9 */
#define OB_WRP_BANK0_SECTOR_10                 FLASH_WRPR_WRP_10  /* Write protection of Bank0 Sector10 */
#define OB_WRP_BANK0_SECTOR_11                 FLASH_WRPR_WRP_11  /* Write protection of Bank0 Sector11 */
#define OB_WRP_BANK0_SECTOR_12                 FLASH_WRPR_WRP_12  /* Write protection of Bank0 Sector12 */
#define OB_WRP_BANK0_SECTOR_13                 FLASH_WRPR_WRP_13  /* Write protection of Bank0 Sector13 */
#define OB_WRP_BANK0_SECTOR_14                 FLASH_WRPR_WRP_14  /* Write protection of Bank0 Sector14 */
#define OB_WRP_BANK0_SECTOR_15                 FLASH_WRPR_WRP_15  /* Write protection of Bank0 Sector15 */

#define OB_WRP_BANK1_SECTOR_0                  FLASH_WRPR_WRP_16  /* Write protection of Bank1 Sector0 */
#define OB_WRP_BANK1_SECTOR_1                  FLASH_WRPR_WRP_17  /* Write protection of Bank1 Sector1 */
#define OB_WRP_BANK1_SECTOR_2                  FLASH_WRPR_WRP_18  /* Write protection of Bank1 Sector2 */
#define OB_WRP_BANK1_SECTOR_3                  FLASH_WRPR_WRP_19  /* Write protection of Bank1 Sector3 */
#define OB_WRP_BANK1_SECTOR_4                  FLASH_WRPR_WRP_20  /* Write protection of Bank1 Sector4 */
#define OB_WRP_BANK1_SECTOR_5                  FLASH_WRPR_WRP_21  /* Write protection of Bank1 Sector5 */
#define OB_WRP_BANK1_SECTOR_6                  FLASH_WRPR_WRP_22  /* Write protection of Bank1 Sector6 */
#define OB_WRP_BANK1_SECTOR_7                  FLASH_WRPR_WRP_23  /* Write protection of Bank1 Sector7 */
#define OB_WRP_BANK1_SECTOR_8                  FLASH_WRPR_WRP_24  /* Write protection of Bank1 Sector8 */
#define OB_WRP_BANK1_SECTOR_9                  FLASH_WRPR_WRP_25  /* Write protection of Bank1 Sector9 */
#define OB_WRP_BANK1_SECTOR_10                 FLASH_WRPR_WRP_26  /* Write protection of Bank1 Sector10 */
#define OB_WRP_BANK1_SECTOR_11                 FLASH_WRPR_WRP_27  /* Write protection of Bank1 Sector11 */
#define OB_WRP_BANK1_SECTOR_12                 FLASH_WRPR_WRP_28  /* Write protection of Bank1 Sector12 */
#define OB_WRP_BANK1_SECTOR_13                 FLASH_WRPR_WRP_29  /* Write protection of Bank1 Sector13 */
#define OB_WRP_BANK1_SECTOR_14                 FLASH_WRPR_WRP_30  /* Write protection of Bank1 Sector14 */
#define OB_WRP_BANK1_SECTOR_15                 FLASH_WRPR_WRP_31  /* Write protection of Bank1 Sector15 */

#define OB_WRP_BANK0_Pages0to31               FLASH_WRPR_WRP_0    /* Write protection of BANK0 Sector0 */
#define OB_WRP_BANK0_Pages32to63              FLASH_WRPR_WRP_1    /* Write protection of BANK0 Sector1 */
#define OB_WRP_BANK0_Pages64to95              FLASH_WRPR_WRP_2    /* Write protection of BANK0 Sector2 */
#define OB_WRP_BANK0_Pages96to127             FLASH_WRPR_WRP_3    /* Write protection of BANK0 Sector3 */
#define OB_WRP_BANK0_Pages128to159            FLASH_WRPR_WRP_4    /* Write protection of BANK0 Sector4 */
#define OB_WRP_BANK0_Pages160to191            FLASH_WRPR_WRP_5    /* Write protection of BANK0 Sector5 */
#define OB_WRP_BANK0_Pages192to223            FLASH_WRPR_WRP_6    /* Write protection of BANK0 Sector6 */
#define OB_WRP_BANK0_Pages224to255            FLASH_WRPR_WRP_7    /* Write protection of BANK0 Sector7 */
#define OB_WRP_BANK0_Pages256to287            FLASH_WRPR_WRP_8    /* Write protection of BANK0 Sector8 */
#define OB_WRP_BANK0_Pages288to319            FLASH_WRPR_WRP_9    /* Write protection of BANK0 Sector9 */
#define OB_WRP_BANK0_Pages320to351            FLASH_WRPR_WRP_10   /* Write protection of BANK0 Sector10 */
#define OB_WRP_BANK0_Pages352to383            FLASH_WRPR_WRP_11   /* Write protection of BANK0 Sector11 */
#define OB_WRP_BANK0_Pages384to415            FLASH_WRPR_WRP_12   /* Write protection of BANK0 Sector12 */
#define OB_WRP_BANK0_Pages416to447            FLASH_WRPR_WRP_13   /* Write protection of BANK0 Sector13 */
#define OB_WRP_BANK0_Pages448to479            FLASH_WRPR_WRP_14   /* Write protection of BANK0 Sector14 */
#define OB_WRP_BANK0_Pages480to511            FLASH_WRPR_WRP_15   /* Write protection of BANK0 Sector15 */

#define OB_WRP_BANK1_Pages0to31               FLASH_WRPR_WRP_16    /* Write protection of BANK1 Sector0 */
#define OB_WRP_BANK1_Pages32to63              FLASH_WRPR_WRP_17    /* Write protection of BANK1 Sector1 */
#define OB_WRP_BANK1_Pages64to95              FLASH_WRPR_WRP_18    /* Write protection of BANK1 Sector2 */
#define OB_WRP_BANK1_Pages96to127             FLASH_WRPR_WRP_19    /* Write protection of BANK1 Sector3 */
#define OB_WRP_BANK1_Pages128to159            FLASH_WRPR_WRP_20    /* Write protection of BANK1 Sector4 */
#define OB_WRP_BANK1_Pages160to191            FLASH_WRPR_WRP_21    /* Write protection of BANK1 Sector5 */
#define OB_WRP_BANK1_Pages192to223            FLASH_WRPR_WRP_22    /* Write protection of BANK1 Sector6 */
#define OB_WRP_BANK1_Pages224to255            FLASH_WRPR_WRP_23    /* Write protection of BANK1 Sector7 */
#define OB_WRP_BANK1_Pages256to287            FLASH_WRPR_WRP_24    /* Write protection of BANK1 Sector8 */
#define OB_WRP_BANK1_Pages288to319            FLASH_WRPR_WRP_25    /* Write protection of BANK1 Sector9 */
#define OB_WRP_BANK1_Pages320to351            FLASH_WRPR_WRP_26    /* Write protection of BANK1 Sector10 */
#define OB_WRP_BANK1_Pages352to383            FLASH_WRPR_WRP_27    /* Write protection of BANK1 Sector11 */
#define OB_WRP_BANK1_Pages384to415            FLASH_WRPR_WRP_28    /* Write protection of BANK1 Sector12 */
#define OB_WRP_BANK1_Pages416to447            FLASH_WRPR_WRP_29    /* Write protection of BANK1 Sector13 */
#define OB_WRP_BANK1_Pages448to479            FLASH_WRPR_WRP_30    /* Write protection of BANK1 Sector14 */
#define OB_WRP_BANK1_Pages480to511            FLASH_WRPR_WRP_31    /* Write protection of BANK1 Sector15 */

#define OB_WRP_AllPages                       FLASH_WRPR_WRP    /* Write protection of all Blocks */
/** 
  * @}
  */
  
/** @defgroup FLASH_Type_Program FLASH type program
  * @{
  */
#define FLASH_TYPEPROGRAM_PAGE             FLASH_CR_PG  /*!<Program 256bytes at a specified address.*/  
#define FLASH_TYPEPROGRAM_USERDATA         FLASH_CR_UPG  /*!<Program 256bytes at userdata address.*/  
/**
  * @}
  */



